import '../styles/FAQ.css';
import React from 'react';
import { useState } from 'react';
import { Fade } from 'react-reveal';

function FAQ() {
    const Data = [
        {
            index : 1,
            question : 'ما مميزات الدورات التى تقدمها اكاديمية افرام ؟',
            answer : 'نحن نعلم بالصعوبات التي تواجه الراغبين بتعلم البرمجة، ومن خبرتنا في التعليم وسوق العمل أعددنا لك هذه الدورة لتأخذك من البداية حتى الاحتراف.سنكون معك خطوةً بخطوة مع فريق من المدربين المختصين بتعليم البرمجة لنرافقك في رحلتك في التعلم.دوراتنا هي منهج تدريبي متكامل، ومحتواها يتكامل مع بعضه لتستطيع تعلم المهارات المطلوبة في سوق العمل.كل دوراتنا تبدأ معك من الأساسيات، التي نشرحها في مسار كامل يعادل دورة تدريبية مستقلة، ثم نأخذك في رحلة رائعة لبناء تطبيقات عملية لطالما كنت تتساءل كيف تم تطويرها.لا تنتهي الخدمات التي نقدمها لك بإنتهاء حصولك على المادة العلمية؛ حيث سنقدم لك خدمة كتابة السيرة الذاتية، ونتابع معك على مواقع العمل حتى تستعيد المبلغ الذي استثمرته في هذه الدورة.أنت طالبنا، ودوراتنا هي استثمار في مستقبلك لتحصل على ما تريده من نجاح في العمل كمبرمج محترف!',
        },
        {
            index : 2,
            question : 'ما مميزات الدورات التى تقدمها اكاديمية افرام ؟',
            answer : 'نحن نعلم بالصعوبات التي تواجه الراغبين بتعلم البرمجة، ومن خبرتنا في التعليم وسوق العمل أعددنا لك هذه الدورة لتأخذك من البداية حتى الاحتراف.سنكون معك خطوةً بخطوة مع فريق من المدربين المختصين بتعليم البرمجة لنرافقك في رحلتك في التعلم.دوراتنا هي منهج تدريبي متكامل، ومحتواها يتكامل مع بعضه لتستطيع تعلم المهارات المطلوبة في سوق العمل.كل دوراتنا تبدأ معك من الأساسيات، التي نشرحها في مسار كامل يعادل دورة تدريبية مستقلة، ثم نأخذك في رحلة رائعة لبناء تطبيقات عملية لطالما كنت تتساءل كيف تم تطويرها.لا تنتهي الخدمات التي نقدمها لك بإنتهاء حصولك على المادة العلمية؛ حيث سنقدم لك خدمة كتابة السيرة الذاتية، ونتابع معك على مواقع العمل حتى تستعيد المبلغ الذي استثمرته في هذه الدورة.أنت طالبنا، ودوراتنا هي استثمار في مستقبلك لتحصل على ما تريده من نجاح في العمل كمبرمج محترف!',
        },
        {
            index : 3,
            question : 'ما مميزات الدورات التى تقدمها اكاديمية افرام ؟',
            answer : 'نحن نعلم بالصعوبات التي تواجه الراغبين بتعلم البرمجة، ومن خبرتنا في التعليم وسوق العمل أعددنا لك هذه الدورة لتأخذك من البداية حتى الاحتراف.سنكون معك خطوةً بخطوة مع فريق من المدربين المختصين بتعليم البرمجة لنرافقك في رحلتك في التعلم.دوراتنا هي منهج تدريبي متكامل، ومحتواها يتكامل مع بعضه لتستطيع تعلم المهارات المطلوبة في سوق العمل.كل دوراتنا تبدأ معك من الأساسيات، التي نشرحها في مسار كامل يعادل دورة تدريبية مستقلة، ثم نأخذك في رحلة رائعة لبناء تطبيقات عملية لطالما كنت تتساءل كيف تم تطويرها.لا تنتهي الخدمات التي نقدمها لك بإنتهاء حصولك على المادة العلمية؛ حيث سنقدم لك خدمة كتابة السيرة الذاتية، ونتابع معك على مواقع العمل حتى تستعيد المبلغ الذي استثمرته في هذه الدورة.أنت طالبنا، ودوراتنا هي استثمار في مستقبلك لتحصل على ما تريده من نجاح في العمل كمبرمج محترف!',
        },
        {
            index : 4,
            question : 'ما مميزات الدورات التى تقدمها اكاديمية افرام ؟',
            answer : 'نحن نعلم بالصعوبات التي تواجه الراغبين بتعلم البرمجة، ومن خبرتنا في التعليم وسوق العمل أعددنا لك هذه الدورة لتأخذك من البداية حتى الاحتراف.سنكون معك خطوةً بخطوة مع فريق من المدربين المختصين بتعليم البرمجة لنرافقك في رحلتك في التعلم.دوراتنا هي منهج تدريبي متكامل، ومحتواها يتكامل مع بعضه لتستطيع تعلم المهارات المطلوبة في سوق العمل.كل دوراتنا تبدأ معك من الأساسيات، التي نشرحها في مسار كامل يعادل دورة تدريبية مستقلة، ثم نأخذك في رحلة رائعة لبناء تطبيقات عملية لطالما كنت تتساءل كيف تم تطويرها.لا تنتهي الخدمات التي نقدمها لك بإنتهاء حصولك على المادة العلمية؛ حيث سنقدم لك خدمة كتابة السيرة الذاتية، ونتابع معك على مواقع العمل حتى تستعيد المبلغ الذي استثمرته في هذه الدورة.أنت طالبنا، ودوراتنا هي استثمار في مستقبلك لتحصل على ما تريده من نجاح في العمل كمبرمج محترف!',
        },
    ]
    const [click, setClick] = useState();
    const handleClick = (index) => {
        setClick(index)
    }
    return (
        <>
        <div className='all00'>
            <Fade>
            <h1>أسئلة شائعة</h1>
            </Fade>
            <div className='all11'>
                {Data.map((item, index) => {
                    return (
                        <Fade bottom distance="20%">
                        <div className={click === item.index ? 'card00Active' : 'card00'} key={index}>
                            <h3 onClick={() => handleClick(item.index)}>{item.question}<span>{click === item.index ? '-' : '+'}</span></h3>
                            <p>{item.answer}</p>
                        </div>
                        </Fade>
                    )
                })}
            </div>
        </div>
        </>
    )
}

export default FAQ;