import '../styles/youllLearnWeb.css';
import React from 'react';
import { Fade } from 'react-reveal';

function YoullLearnCyber() {
    const Data = [
        {
            h3 : 'حماية الأنظمة والبيانات من التهديدات السيبرانية والهجمات الإلكترونية',
            p : 'ستتعلم كيفية حماية الأنظمة والبيانات من التهديدات السيبرانية والهجمات الإلكترونية.',
        },
        {
            h3 : 'ستكتسب المهارات لاكتشاف الثغرات وتقييم الضعف في الأنظمة والشبكات.',
            p : 'ستكتسب المهارات لاكتشاف الثغرات وتقييم الضعف في الأنظمة والشبكات.ستكتسب المهارات لاكتشاف الثغرات وتقييم الضعف في الأنظمة والشبكات.',
        },
        {
            h3 : 'ستتعلم تقنيات اختبار الاختراق واختبار الأمان لتعزيز الحماية.',
            p : 'ستتعلم تقنيات اختبار الاختراق واختبار الأمان لتعزيز الحماية.ستتعلم تقنيات اختبار الاختراق واختبار الأمان لتعزيز الحماية.',
        },
        {
            h3 : 'بعد انتهائك من الدورة، ستكون قادرًا على تطوير استراتيجيات الأمان والعمل كمختص في مجال الأمان السيبراني.',
            p : 'بعد انتهائك من الدورة، ستكون قادرًا على تطوير استراتيجيات الأمان والعمل كمختص في مجال الأمان السيبراني.بعد انتهائك من الدورة، ستكون قادرًا على تطوير استراتيجيات الأمان والعمل كمختص في مجال الأمان السيبراني.',
        },
        {
            h3 : 'حماية الأنظمة والبيانات من التهديدات السيبرانية والهجمات الإلكترونية',
            p : 'ستتعلم كيفية حماية الأنظمة والبيانات من التهديدات السيبرانية والهجمات الإلكترونية.',
        },
        {
            h3 : 'ستكتسب المهارات لاكتشاف الثغرات وتقييم الضعف في الأنظمة والشبكات.',
            p : 'ستكتسب المهارات لاكتشاف الثغرات وتقييم الضعف في الأنظمة والشبكات.ستكتسب المهارات لاكتشاف الثغرات وتقييم الضعف في الأنظمة والشبكات.',
        },
        {
            h3 : 'ستتعلم تقنيات اختبار الاختراق واختبار الأمان لتعزيز الحماية.',
            p : 'ستتعلم تقنيات اختبار الاختراق واختبار الأمان لتعزيز الحماية.ستتعلم تقنيات اختبار الاختراق واختبار الأمان لتعزيز الحماية.',
        },
        {
            h3 : 'بعد انتهائك من الدورة، ستكون قادرًا على تطوير استراتيجيات الأمان والعمل كمختص في مجال الأمان السيبراني.',
            p : 'بعد انتهائك من الدورة، ستكون قادرًا على تطوير استراتيجيات الأمان والعمل كمختص في مجال الأمان السيبراني.بعد انتهائك من الدورة، ستكون قادرًا على تطوير استراتيجيات الأمان والعمل كمختص في مجال الأمان السيبراني.',
        },
    ]
    return (
        <>
        <div className='all55'>
            <Fade>
            <h1>ماذا ستتعلم في هذه الدورة؟</h1>
            </Fade>
            <div className='avram-all66'>
                {Data.map((item, index) => {
                    return (
                        <Fade right>
                        <div className='avram-card66' key={index}>
                            <h3><i class="fa-solid fa-circle-check"/>{item.h3}</h3>
                            <p>{item.p}</p>
                        </div>
                        </Fade>
                    )
                })}
            </div>
        </div>
        </>
    )
}

export default YoullLearnCyber;